Tekla Open API Reference for Tekla Structures 2025
SymbolAttributes Constructor
Overload List
Name | Description
Symbol.SymbolAttributes()
 Creates a new default symbol attributes instance that loads standard attributes.
Symbol.SymbolAttributes(String)
 Creates a symbol attributes instance that loads the specified attributes.
Top
See Also
Reference
Symbol.SymbolAttributes Class
Tekla.Structures.Drawing Namespace